app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"  ORDER BY created_at desc
SELECT "articles".* FROM "articles"
---
  def index
    @articles = Article.all.order('created_at desc')
    @markdown = Redcarpet::Markdown.new(Redcarpet::Render::HTML)
    @articles = Article.title_includes(params[:search]) if params[:search].present?

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "First Title"], ["body", "Content of first title"], ["created_at", "2016-06-14 12:47:13.774566"], ["updated_at", "2016-06-14 12:47:13.774566"]]
---
  def create
    @article = current_user.articles.build(article_params)

    respond_to do |format|
      if @article.save

UPDATE "articles" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "articles"."id" = $4
---
  def update
    respond_to do |format|
      if @article.update(article_params)